In [38]:
import pandas as pd

#To take care of missing data
from sklearn.preprocessing import Imputer

from sklearn.model_selection import train_test_split

In [22]:
data=pd.read_csv('data/Data.csv')

In [23]:
#To print the dataset in jupyter notebook
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [24]:
X=data.iloc[:,:-1].values

In [25]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

Independent Variable--> Country,Age , Salary

Dependent Variable--> Purchased

We will use  Independent Variable to Predict Dependent Variable in Machine Learning.

In [26]:
imputer=Imputer(missing_values='NaN',strategy='mean',axis=0)

In [27]:
imputer=imputer.fit(X[:,1:3])

In [28]:
X[:,1:3]=imputer.transform(X[:,1:3])

In [29]:
age_average=data['Age'].mean()
salary_average=data['Salary'].mean()

In [30]:
data['Age']=data['Age'].fillna(age_average)
data['Salary']=data['Salary'].fillna(salary_average)

In [31]:
data

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

Country and Purchased are categorical Variable

Since Machine Learning model are mathematical, we cannot fit the text .

So we will convert the text into numeric.
http://queirozf.com/entries/one-hot-encoding-a-feature-on-a-pandas-dataframe-an-example

In [33]:
df1=pd.get_dummies(data['Country'])

In [34]:
df1

   France  Germany  Spain
0       1        0      0
1       0        0      1
2       0        1      0
3       0        0      1
4       0        1      0
5       1        0      0
6       0        0      1
7       1        0      0
8       0        1      0
9       1        0      0

System will think Spain(0) is lesser than germany(2) , this might mislead the system.

Hence we should use Dummy Variable to prevent it.

In [35]:
frames=[data,df1]
frames

[   Country        Age        Salary Purchased
 0   France  44.000000  72000.000000        No
 1    Spain  27.000000  48000.000000       Yes
 2  Germany  30.000000  54000.000000        No
 3    Spain  38.000000  61000.000000        No
 4  Germany  40.000000  63777.777778       Yes
 5   France  35.000000  58000.000000       Yes
 6    Spain  38.777778  52000.000000        No
 7   France  48.000000  79000.000000       Yes
 8  Germany  50.000000  83000.000000        No
 9   France  37.000000  67000.000000       Yes,    France  Germany  Spain
 0       1        0      0
 1       0        0      1
 2       0        1      0
 3       0        0      1
 4       0        1      0
 5       1        0      0
 6       0        0      1
 7       1        0      0
 8       0        1      0
 9       1        0      0]

In [36]:
result=pd.concat(frames,axis=1)

In [37]:
result

   Country        Age        Salary Purchased  France  Germany  Spain
0   France  44.000000  72000.000000        No       1        0      0
1    Spain  27.000000  48000.000000       Yes       0        0      1
2  Germany  30.000000  54000.000000        No       0        1      0
3    Spain  38.000000  61000.000000        No       0        0      1
4  Germany  40.000000  63777.777778       Yes       0        1      0
5   France  35.000000  58000.000000       Yes       1        0      0
6    Spain  38.777778  52000.000000        No       0        0      1
7   France  48.000000  79000.000000       Yes       1        0      0
8  Germany  50.000000  83000.000000        No       0        1      0
9   France  37.000000  67000.000000       Yes       1        0      0

In [43]:
result=result.drop('Country',axis=1)

In [44]:
result

         Age        Salary Purchased  France  Germany  Spain
0  44.000000  72000.000000        No       1        0      0
1  27.000000  48000.000000       Yes       0        0      1
2  30.000000  54000.000000        No       0        1      0
3  38.000000  61000.000000        No       0        0      1
4  40.000000  63777.777778       Yes       0        1      0
5  35.000000  58000.000000       Yes       1        0      0
6  38.777778  52000.000000        No       0        0      1
7  48.000000  79000.000000       Yes       1        0      0
8  50.000000  83000.000000        No       0        1      0
9  37.000000  67000.000000       Yes       1        0      0

In [45]:
df2=pd.get_dummies(data['Purchased'])
df2

   No  Yes
0   1    0
1   0    1
2   1    0
3   1    0
4   0    1
5   0    1
6   1    0
7   0    1
8   1    0
9   0    1

In [46]:
frame2=[result,df2]

In [47]:
frame2

[         Age        Salary Purchased  France  Germany  Spain
 0  44.000000  72000.000000        No       1        0      0
 1  27.000000  48000.000000       Yes       0        0      1
 2  30.000000  54000.000000        No       0        1      0
 3  38.000000  61000.000000        No       0        0      1
 4  40.000000  63777.777778       Yes       0        1      0
 5  35.000000  58000.000000       Yes       1        0      0
 6  38.777778  52000.000000        No       0        0      1
 7  48.000000  79000.000000       Yes       1        0      0
 8  50.000000  83000.000000        No       0        1      0
 9  37.000000  67000.000000       Yes       1        0      0,    No  Yes
 0   1    0
 1   0    1
 2   1    0
 3   1    0
 4   0    1
 5   0    1
 6   1    0
 7   0    1
 8   1    0
 9   0    1]

In [48]:
result=pd.concat(frame2,axis=1)

In [53]:
result_test=result[['No','Yes']]

In [51]:
X_train,X_test,y_train,y_test=train_test_split(result,test_size=0.2)

ValueError: not enough values to unpack (expected 4, got 2)